<?php
$txt['header_menu'] = 'Меню';
$txt['header_topics'] = 'Темы';
$txt['header_posts'] = 'Сообщения';
$txt['of_the_topic'] = 'темы';
$txt['topic'] = 'Тема';
$txt['modified'] = 'изменено ';
$txt['postcount'] = ' сообщ.';

$txt['from'] = '';

$txt['explain_addbranch'] = 'Ответить на это сообщение';
$txt['explain_plainanswer'] = 'Ответить на это сообщение';
$txt['explain_editmessage'] = 'Редактировать сообщение';
$txt['explain_deletemessage'] = 'Удалить сообщение';

$txt['how_to_send_post'] = 'Вы также можете отправить сообщение, нажав Ctrl+Enter, или Alt+Enter';

$txt['cancel'] = 'Отмена';
$txt['send'] = 'Отправить';
$txt['save'] = 'Сохранить';
$txt['answer'] = 'Ответить';

$txt['error_missing_msg_body'] = 'Ошибка! Сообщение не может быть пустым';
$txt['no_topic_name'] = '<span class="subtext">Без названия</span>';

$txt['msg_del_confirm'] = 'Это сообщение будет безвозвратно удалено. Продолжить?';
$txt['post_locked'] = "Это сообщение заблокировано. \\nСкорее всего - вданный момент его кто-то редактирует";

$txt['login_name'] = 'Логин или email:';
$txt['login_pass'] = 'Пароль:';
$txt['login_memorize'] = 'Запомнить';
$txt['login_btn'] = 'Вход';
$txt['login_logout'] = 'Выход';
$txt['login_reg'] = 'Регистрация';

$txt['title_register'] = 'Регистрация нового пользователя';

$txt['reg_login'] = 'Логин';
$txt['reg_email'] = 'email';
$txt['reg_pass1'] = 'Пароль';
$txt['reg_pass2'] = 'Повтор пароля';
$txt['reg_quiz'] = 'Загадка';
$txt['reg_answer'] = 'Ответ';

$txtp['reg_login_expalin'] =
	'Логин должен состоять из латинских символов или цифр и не содержать пробелов, или знаков пунктуации';
$txtp['reg_pass_expalin'] =
	'Пароли должны совпадать. Для большей безопасности пароля используйте в нем символы в разных
регистрах и цифры';
$txtp['reg_email_expalin'] =
	'email должен быть реальным. На него вам придет письмо, при помощи которого вы сможете
	активировать аккаунт.<br>Мы также поддерживаем сервис <a href="http://www.gravatar.com">gravatar</a>,
	при помощи которого вы можете привязать свой аватар к данному email-у. Другого способа залить
	аватар у нас пока нет, sorry :)';

$quiz[0]['body'] = 'Сидит дед, во сто шуб одет. Кто его раздевает, тот слезы ...';
$quiz[0]['answer'] = 'проливает';

$quiz[1]['body'] = 'В лесу родилась елочка, в лесу она росла, зимой и летом стройная, зеленая ...';
$quiz[1]['answer'] = 'была';

$quiz[2]['body'] = 'Говорят не повезет, если черный кот дорогу ...';
$quiz[2]['answer'] = 'перейдет';

$quiz[3]['body'] = 'Куда ты тропинка меня привела? Без милой принцессы мне жизнь не ...';
$quiz[3]['answer'] = 'мила';
?>
